
* Analysis

#+name: aggregate
#+header: :db ":memory:"
#+header: :colnames yes
#+header: :var bcnt=BCNT cosr=CosmicRay ctr=Counter dch=Dchain drsp=DetectorResponse fus=Fusion mu=Muon ns=NeutronSource fc=fc
#+header: :var nreac=NuclearReaction parth=ParticleTherapy phth=PhotonTherapy sicon=Semiconductor ts=TrackStructure xr=XRay
#+header: :mode csv
#+header: :header on
#+begin_src sqlite

  drop table if exists bcnt;
  create table bcnt(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv bcnt

  drop table if exists cosr;
  create table cosr(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv cosr

  drop table if exists ctr;
  create table ctr(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv ctr

  drop table if exists dch;
  create table dch(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv dch

  drop table if exists drsp;
  create table drsp(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv drsp

  drop table if exists fus;
  create table fus(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv fus

  drop table if exists mu;
  create table mu(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv mu

  drop table if exists ns;
  create table ns(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv mu

  drop table if exists nreac;
  create table nreac(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv nreac

  drop table if exists parth;
  create table parth(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv parth

  drop table if exists phth;
  create table phth(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv phth

  drop table if exists sicon;
  create table sicon(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv sicon

  drop table if exists ts;
  create table ts(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv ts

  drop table if exists xr;
  create table xr(perc_t real, cumulative_t real, self_t real, calls int, self_tcall real, total_tcall real, fnc text primary key, file text);
  .mode csv xr

  drop table if exists fc;
  create table fc(file text primary key, model int, reasoning text);
  .mode csv fc




  .import $bcnt bcnt
  .import $cosr cosr
  .import $ctr ctr
  .import $dch dch
  .import $drsp drsp
  .import $fus fus
  .import $mu mu
  .import $ns ns
  .import $nreac nreac
  .import $parth parth
  .import $phth phth
  .import $sicon sicon
  .import $ts ts
  .import $xr xr
  .import $fc fc


  drop table if exists aggregates;

  create table aggregates(Example text, model real, non_model real, total real);

  insert into aggregates
  select 'BCNT', sum(case when fc.model then bcnt.perc_t else 0 end) as model,
  sum(case when not fc.model then bcnt.perc_t else 0 end) as non_model,
  sum(bcnt.self_t)
  from bcnt
  inner join fc
  on substr(bcnt.file, 2, instr(bcnt.file, ":") - 2) = fc.file;

  insert into aggregates
  select 'Cosmic Ray', sum(case when fc.model then cosr.perc_t else 0 end) as model,
  sum(case when not fc.model then cosr.perc_t else 0 end) as non_model,
  sum(cosr.self_t)
  from cosr
  inner join fc
  on substr(cosr.file, 2, instr(cosr.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Counter', sum(case when fc.model then ctr.perc_t else 0 end) as model,
  sum(case when not fc.model then ctr.perc_t else 0 end) as non_model,
  sum(ctr.self_t)
  from ctr
  inner join fc
  on substr(ctr.file, 2, instr(ctr.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'DChain', sum(case when fc.model then dch.perc_t else 0 end) as model,
  sum(case when not fc.model then dch.perc_t else 0 end) as non_model,
  sum(dch.self_t)
  from dch
  inner join fc
  on substr(dch.file, 2, instr(dch.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Detector Response', sum(case when fc.model then drsp.perc_t else 0 end) as model,
  sum(case when not fc.model then drsp.perc_t else 0 end) as non_model,
  sum(drsp.self_t)
  from drsp
  inner join fc
  on substr(drsp.file, 2, instr(drsp.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Fusion', sum(case when fc.model then fus.perc_t else 0 end) as model,
  sum(case when not fc.model then fus.perc_t else 0 end) as non_model,
  sum(fus.self_t)
  from fus
  inner join fc
  on substr(fus.file, 2, instr(fus.file, ":") - 2) = fc.file;



  insert into aggregates
  select 'Muon', sum(case when fc.model then mu.perc_t else 0 end) as model,
  sum(case when not fc.model then mu.perc_t else 0 end) as non_model,
  sum(mu.self_t)
  from mu
  inner join fc
  on substr(mu.file, 2, instr(mu.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Neutron Source', sum(case when fc.model then ns.perc_t else 0 end) as model,
  sum(case when not fc.model then ns.perc_t else 0 end) as non_model,
  sum(ns.self_t)
  from ns
  inner join fc
  on substr(ns.file, 2, instr(ns.file, ":") - 2) = fc.file;



  insert into aggregates
  select 'Nuclear Reaction', sum(case when fc.model then nreac.perc_t else 0 end) as model,
  sum(case when not fc.model then nreac.perc_t else 0 end) as non_model,
  sum(nreac.self_t)
  from nreac
  inner join fc
  on substr(nreac.file, 2, instr(nreac.file, ":") - 2) = fc.file;



  insert into aggregates
  select 'Particle Therapy', sum(case when fc.model then parth.perc_t else 0 end) as model,
  sum(case when not fc.model then parth.perc_t else 0 end) as non_model,
  sum(parth.self_t)
  from parth
  inner join fc
  on substr(parth.file, 2, instr(parth.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Photon Therapy', sum(case when fc.model then phth.perc_t else 0 end) as model,
  sum(case when not fc.model then phth.perc_t else 0 end) as non_model,
  sum(phth.self_t)
  from phth
  inner join fc
  on substr(phth.file, 2, instr(phth.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Semiconductor', sum(case when fc.model then sicon.perc_t else 0 end) as model,
  sum(case when not fc.model then sicon.perc_t else 0 end) as non_model,
  sum(sicon.self_t)
  from sicon
  inner join fc
  on substr(sicon.file, 2, instr(sicon.file, ":") - 2) = fc.file;


  insert into aggregates
  select 'Track Structure', sum(case when fc.model then ts.perc_t else 0 end) as model,
  sum(case when not fc.model then ts.perc_t else 0 end) as non_model,
  sum(ts.self_t)
  from ts
  inner join fc
  on substr(ts.file, 2, instr(ts.file, ":") - 2) = fc.file;

  insert into aggregates
  select 'X-Ray', sum(case when fc.model then xr.perc_t else 0 end) as model,
  sum(case when not fc.model then xr.perc_t else 0 end) as non_model,
  sum(xr.self_t)
  from xr
  inner join fc
  on substr(xr.file, 2, instr(xr.file, ":") - 2) = fc.file;

  select * from aggregates order by total;

#+end_src

#+RESULTS: aggregate
| Example           |            model |        non_model |            total |
|-------------------+------------------+------------------+------------------|
| Neutron Source    |            42.34 |            57.73 |             0.26 |
| BCNT              |            45.91 |            54.07 |             0.98 |
| Counter           |            87.25 |            12.68 | 2.90999999999999 |
| Detector Response | 82.6900000000001 |            17.36 | 4.62999999999998 |
| DChain            |            26.85 | 72.9799999999999 | 6.09999999999999 |
| Fusion            |            66.29 |             33.7 | 7.32999999999999 |
| Photon Therapy    |             36.6 | 63.4900000000001 | 7.75999999999999 |
| X-Ray             |             7.25 | 92.7500000000001 |            11.06 |
| Nuclear Reaction  |            59.61 |            40.39 |            13.78 |
| Particle Therapy  |            50.19 | 49.6099999999999 | 18.2100000000001 |
| Cosmic Ray        | 98.1400000000002 |             1.77 | 24.5900000000001 |
| Semiconductor     |            28.74 | 71.3000000000001 |            25.17 |
| Muon              | 92.5800000000001 |             7.61 |            28.26 |
| Track Structure   |            85.15 |            14.88 |           121.64 |



#+begin_src gnuplot :var data=aggregate :file hist.tex

  set title "Model-Level Code Dominates Monte-Carlo Runtime"

  set terminal tikz font ",10"
  set ylabel "Share of Runtime (\\%)"

  set key outside samplen 1
  set style data histograms
  set style histogram rowstacked
  set boxwidth 1 relative
  set style fill solid 1.0 border -1
  set yrange [0:100]
  set xtics rotate by -60

  plot data using 2 t "Model", '' using 3:xticlabels(1) t "Non-Model"

#+end_src

#+RESULTS:
[[file:hist.tex]]
